MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/screen.cpp
	/* Enable the DSI host and wrapper : but LTDC is not started yet at this stage */
	HAL_DSI_Start(&(hdsi_eval));
	/*************************End DSI Initialization*******************************/

	/************************LTDC Initialization***********************************/

	/* Timing Configuration */
	LtdcHandler.Init.HorizontalSync = (HSA - 1);
	LtdcHandler.Init.AccumulatedHBP = (HSA + HBP - 1);
	LtdcHandler.Init.AccumulatedActiveW = (pDisplay->LcdTimings->X + HSA + HBP
			- 1);
	LtdcHandler.Init.TotalWidth =
			(pDisplay->LcdTimings->X + HSA + HBP + HFP - 1);

	/* Initialize the LCD pixel width and pixel height */
	LtdcHandler.LayerCfg->ImageWidth = pDisplay->LcdTimings->X;
	LtdcHandler.LayerCfg->ImageHeight = pDisplay->LcdTimings->Y;

	/* Background value */
	LtdcHandler.Init.Backcolor.Blue = 0;
	LtdcHandler.Init.Backcolor.Green = 0;
	LtdcHandler.Init.Backcolor.Red = 0;
	LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
	LtdcHandler.Instance = LTDC;

	/* Get LTDC Configuration from DSI Configuration */
	HAL_LTDC_StructInitFromVideoConfig(&(LtdcHandler), &(hdsivideo_handle));

	/* Initialize the LTDC */
	HAL_LTDC_Init(&LtdcHandler);

	/* Initialize the font */
	DMA2D_Config();
	BSP_LCD_LayerDefaultInit(screenHeandle, 0, LCD_FB_START_ADDRESS);
	//BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

	/************************End LTDC Initialization*******************************/

	/***********************OTM8009A Initialization********************************/

	/* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
	 *  depending on configuration set in 'hdsivideo_handle'.
	 */
	OTM8009A_Init(screenHeandle, hdsivideo_handle.ColorCoding);
	/***********************End OTM8009A Initialization****************************/
	pDisplay->sClipRegion.sXMin = 0;
	pDisplay->sClipRegion.sYMin = 0;
	pDisplay->sClipRegion.sXMax = pDisplay->LcdTimings->X;
	pDisplay->sClipRegion.sYMax = pDisplay->LcdTimings->Y;
	return LCD_OK;
}
#endif
/**
 * @brief  Fills a buffer.
 * @param  LayerIndex: Layer index
 * @param  pDst: Pointer to destination buffer
 * @param  xSize: Buffer width
 * @param  ySize: Buffer height
 * @param  OffLine: Offset
 * @param  ColorIndex: Color index
 */
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize,
		uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
	/*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	Dma2dHandle.Init.Mode = DMA2D_R2M;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = OffLine;

	/* DMA2D Initialization */
	if (HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if (HAL_DMA2D_ConfigLayer(&Dma2dHandle, LayerIndex) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, ColorIndex | 0xFF000000,
					(uint32_t) pDst, xSize, ySize) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
			}
		}
	}
}

#endif

#if defined(STM32F769xx) || defined(STM32F779xx)

void GI::Dev::IntScreen::init(LCD_TIMINGS *timings, GI::Dev::Gpio* backlight)
{
    memset(this, 0, sizeof(*this));
	this->backlight = backlight;
	LcdTimings = timings;

	setOn_Ptr = &GI::Dev::IntScreen::_setOn;
	setOff_Ptr = &GI::Dev::IntScreen::_setOff;
	setBacklight_Ptr = &GI::Dev::IntScreen::_setBacklight;
    //cacheClean_Ptr = &GI::Dev::IntScreen::_cacheClean;
    drawPixel_Ptr = &GI::Dev::IntScreen::_drawPixel;
    drawRectangle_Ptr = &GI::Dev::IntScreen::_drawRectangle;
    drawHLine_Ptr = &GI::Dev::IntScreen::_drawHLine;
    drawVLine_Ptr = &GI::Dev::IntScreen::_drawVLine;
    clear_Ptr = &GI::Dev::IntScreen::_clear;
    driverHandler_Ptr = (void *)this;
	if (BSP_LCD_InitEx((void *) this) == LCD_OK)
	{
		clear(0xFFFF0F0F);
		err = SYS_ERR_OK;
	}
	else
	{
		err = SYS_ERR_INIT;
	}
#ifdef SSD2119
	STM32f4_Discovery_LCD_Init();
#endif
}

void GI::Dev::IntScreen::deinit()
{

}
/**********************************************/
void GI::Dev::IntScreen::_setOn(void *driverHandlerPtr)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	driverHandler->err = SYS_ERR_NOT_IMPLEMENTED;
	/* Send Display on DCS command to display */
	/*HAL_DSI_ShortWrite(&(hdsi_eval),
	 hdsivideo_handle.VirtualChannelID,
	 DSI_DCS_SHORT_PKT_WRITE_P1,
	 OTM8009A_CMD_DISPON,
	 0x00);*/
}
/**********************************************/
void GI::Dev::IntScreen::_setOff(void *driverHandlerPtr)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	driverHandler->err = SYS_ERR_NOT_IMPLEMENTED;
	/* Send Display off DCS Command to display */
	/*HAL_DSI_ShortWrite(&(hdsi_eval),
	 hdsivideo_handle.VirtualChannelID,
	 DSI_DCS_SHORT_PKT_WRITE_P1,
	 OTM8009A_CMD_DISPOFF,
	 0x00);*/
}
//#######################################################################################
SysErr GI::Dev::IntScreen::_setBacklight(void *driverHandlerPtr, unsigned char value)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	driverHandler->err = SYS_ERR_OK;
	if (driverHandler->backlight)
	{
		if (value)
			driverHandler->backlight->setOut(1);
		else
			driverHandler->backlight->setOut(0);
		return SYS_ERR_OK;
	}
	driverHandler->err = SYS_ERR_NOT_INITIALIZED;
	return SYS_ERR_NOT_INITIALIZED;
}
//#######################################################################################
bool GI::Dev::IntScreen::_copyScreen(void *driverHandlerPtr, void *_pDisplayFrom, bool put_cursor,
		signed int X, signed int Y, unsigned int color)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	GI::Dev::Screen *pDisplayTo = driverHandler;
	GI::Dev::Screen *pDisplayFrom = (GI::Dev::Screen *) _pDisplayFrom;
	if (pDisplayTo->LcdTimings->X != pDisplayFrom->LcdTimings->X
			|| pDisplayTo->LcdTimings->Y != pDisplayFrom->LcdTimings->Y)
		return false;
	CacheDataCleanBuff((unsigned int) pDisplayFrom->DisplayData,
			(pDisplayFrom->LcdTimings->X * pDisplayFrom->LcdTimings->Y
					* sizeof(pDisplayFrom->DisplayData[0]))
					+ (pDisplayFrom->LcdTimings->palete_len
							* sizeof(pDisplayFrom->DisplayData[0])));
	signed int LineCnt = 0;
	volatile unsigned int* ScreenBuff = pDisplayTo->DisplayData
			+ pDisplayTo->LcdTimings->palete_len;
	volatile unsigned int* _ScreenBuff = pDisplayFrom->DisplayData
			+ pDisplayTo->LcdTimings->palete_len;

	for (; LineCnt < pDisplayTo->LcdTimings->Y; LineCnt++)
	{
		memcpy((void *) (ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)),
				(void *) (_ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)),
				(sizeof(ScreenBuff[0]) * pDisplayTo->LcdTimings->X));
		if (put_cursor == true && LineCnt >= Y && LineCnt <= Y + 2)
		{
			signed int cnt_x = X;
			for (; cnt_x < X + 2; cnt_x++)
				driverHandler->drawPixel(cnt_x, LineCnt, color);
		}
	}
	return true;
}
/*//#######################################################################################
void GI::Dev::IntScreen::_cacheClean(void *driverHandlerPtr, signed int x_start, signed int y_start,
		signed int x_len, signed int y_len)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
}*/
//#######################################################################################
void GI::Dev::IntScreen::_drawRectangle(void *driverHandlerPtr, signed int x_start, signed int y_start,
		signed int x_len, signed int y_len, bool fill, unsigned int color)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	signed int x_end = x_start + x_len, y_end = y_start + y_len;
	if (x_start >= driverHandler->sClipRegion.sXMax || y_start >= driverHandler->sClipRegion.sYMax
			|| x_end < driverHandler->sClipRegion.sXMin || y_end < driverHandler->sClipRegion.sYMin)
		return;
	register signed int LineCnt = y_start;
	//volatile unsigned int* ScreenBuff = (volatile unsigned int *)LCD_FB_START_ADDRESS;
	unsigned int _color = color | 0xFF000000;
	if (fill)
	{
		if (LineCnt < driverHandler->sClipRegion.sYMin)
			LineCnt = driverHandler->sClipRegion.sYMin;
		signed int _x_start = x_start;
		if (_x_start < driverHandler->sClipRegion.sXMin)
			_x_start = driverHandler->sClipRegion.sXMin;
		register signed int _x_end = x_end;
		if (_x_end > driverHandler->sClipRegion.sXMax)
			_x_end = driverHandler->sClipRegion.sXMax;
		register signed int _y_end = y_end;
		if (_y_end > driverHandler->sClipRegion.sYMax)
			_y_end = driverHandler->sClipRegion.sYMax;
		uint32_t Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
				+ 4 * (driverHandler->LcdTimings->X * LineCnt + _x_start);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *) Xaddress, _x_end - _x_start,
				_y_end - LineCnt, driverHandler->LcdTimings->X - (_x_end - _x_start), _color);
		return;
	}

	driverHandler->drawHLine(x_start, x_len - 1, y_start, 1, color);
	driverHandler->drawHLine(x_start, x_len, (y_start + y_len) - 1, 1, color);
	driverHandler->drawVLine(y_start, y_len - 1, x_start, 1, color);
	driverHandler->drawVLine(y_start, x_len, (x_start + x_len) - 1, 1, color);
	return;
}
//#######################################################################################
void GI::Dev::IntScreen::_drawPixel(void *driverHandlerPtr, signed int X, signed int Y, unsigned int color)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
	if (X >= driverHandler->sClipRegion.sXMin && Y >= driverHandler->sClipRegion.sYMin
			&& X < driverHandler->sClipRegion.sXMax && Y < driverHandler->sClipRegion.sYMax)
	{
		uint32_t Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
				+ 4 * (driverHandler->LcdTimings->X * Y + X);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *) Xaddress, 1, 1, driverHandler->LcdTimings->X - 1,
				color | 0xFF000000);
	}
}
//#######################################################################################
void GI::Dev::IntScreen::_copyRectangle16Bit(void *driverHandlerPtr, unsigned short *rgb_buffer,
		unsigned int x1, unsigned int y1, unsigned int width,
		unsigned int height)
{
	//tDisplay *pDisplay = (tDisplay *)_pDisplay;
}
//#######################################################################################
void GI::Dev::IntScreen::_copyRectangle24Bit(void *driverHandlerPtr, unsigned char *rgb_buffer,
		unsigned long x1, unsigned long y1, unsigned long width,
		unsigned long height)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;
}
//#######################################################################################
void GI::Dev::IntScreen::_copyRectangle32Bit(void *driverHandlerPtr, unsigned char *rgb_buffer,
		unsigned int x1, unsigned int y1, unsigned int width,
		unsigned int height)
{
	GI::Dev::IntScreen *driverHandler = (GI::Dev::IntScreen *)driverHandlerPtr;

	/*//tWindow *ParentWindow = (tWindow*)settings->Internals.ParentWindow;
	 //tDisplay *pDisplay = settings->Internals.pDisplay;
	 //tRectangle back_up_clip = sClipRegion;
	 //sClipRegion = settings->Internals.PictureWindowLimits;
	 ////put_pixel(pDisplay, X + settings->Position.X + 2, Y + settings->Position.Y + 2, color);
	 tRectangle rectangle;
	 rectangle.sXMin = 0;
	 rectangle.sXMax = width;
	 rectangle.sYMin = 0;
	 rectangle.sYMax = height;
	 tRectangle *dest_rectangle = &rectangle;
	 tRectangle *src_rectangle = &rectangle;

	 signed int dest_X_StartBox = x1;
	 signed int dest_Y_StartBox = y1;
	 //signed int dest_X_EndBox = settings->Internals.Position.X + settings->Internals.Size.X;
	 //signed int dest_Y_EndBox = settings->Internals.Position.Y + settings->Internals.Size.Y;

